app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (UPPER(movies.'title') LIKE UPPER('%%')) AND (UPPER(movies.'director') LIKE UPPER('%%')) AND (runtime in minutes runtime_in_minutes > 120)

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "release_date", "director", "runtime_in_minutes", "poster_image_url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "movies" SET "poster_image_url" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["poster_image_url", "http://i.imgur.com/7JVQgpN.jpg"], ["updated_at", "2016-06-21 20:08:03.832374"], ["id", 2]]