app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.build(review_params)
    @review.user_id = current_user.id

    if @review.save
---
INSERT INTO "reviews" ("text", "rating_out_of_ten", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["text", "It sucked!"], ["rating_out_of_ten", 1], ["movie_id", 1], ["user_id", 2], ["created_at", "2016-06-21 21:56:35.060849"], ["updated_at", "2016-06-21 21:56:35.060849"]]

  def load_movie
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]